In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
data=pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
A=pd.Series([2,5,3,2],index=['a','b','c','d'])
A

a    2
b    5
c    3
d    2
dtype: int64

In [6]:
type(A)

pandas.core.series.Series

In [7]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
type(A.values)

numpy.ndarray

In [9]:
type(A)

pandas.core.series.Series

In [10]:
A['a']

2

In [11]:
A['a':'c']

a    2
b    5
c    3
dtype: int64

In [12]:
grades_dict={
    'a':4,
    'a-':'3.5',
    'b-':70,
    'b':2
}
grades=pd.Series(grades_dict)
print(grades)

a       4
a-    3.5
b-     70
b       2
dtype: object

In [13]:
marks_dict={
    'a':85,
    'a-':80,
    'b':75,
    'b-':70,
    'b':65
}
marks=pd.Series(marks_dict)
print(marks)

a     85
a-    80
b     65
b-    70
dtype: int64

In [14]:
print(grades.values)
print(marks.values)

[4 '3.5' 70 2]
[85 80 65 70]

In [15]:
rs=pd.DataFrame({'grades':grades,'marks':marks})
rs

   grades  marks
a       4     85
a-    3.5     80
b       2     65
b-     70     70

In [16]:
rs.T

         a   a-   b  b-
grades   4  3.5   2  70
marks   85   80  65  70

In [17]:
rs.transpose()

         a   a-   b  b-
grades   4  3.5   2  70
marks   85   80  65  70

In [18]:
rs.columns

Index(['grades', 'marks'], dtype='object')

In [19]:
rs['scaleMarks']=rs['marks']/90
rs

   grades  marks  scaleMarks
a       4     85    0.944444
a-    3.5     80    0.888889
b       2     65    0.722222
b-     70     70    0.777778

In [20]:
G=rs[rs['marks']>70]
print(G)

   grades  marks  scaleMarks
a       4     85    0.944444
a-    3.5     80    0.888889

In [21]:
another=pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])
another

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [22]:
another.fillna(0)

     a  b    c
0  1.0  2  0.0
1  0.0  3  4.0

In [23]:
another.loc[:]

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [24]:
another.loc[1]

a    NaN
b    3.0
c    4.0
Name: 1, dtype: float64

In [25]:
another.loc[:,'b']

0    2
1    3
Name: b, dtype: int64

In [26]:
other=pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])
other

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [27]:
other.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []